aboutES/elasticsearch.html
<!doctype html>
<html lang="en">
<head>
<title>Elastic Search研究记录</title>
<!-- 2017-01-07 Sat 23:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Elastic Search研究记录</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ElasticSearch安装</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>add user
</li>
</ul>
<pre class="example">
useradd -m -s /bin/bash qzt_es
</pre>
<ul class="org-ul">
<li>jdk
</li>
</ul>
<pre class="example">
jdk-8u73-linux-x64.tar.gz
export JAVA_HOME=/home/qzt_es/jdk1.8.0_73
export CLASSPATH=$JAVA_HOME/lib:$JAVA_HOME/jre/lib:.
export PATH=$JAVA_HOME/bin:$JAVA_HOME/jre/bin:$PATH
</pre>
<ul class="org-ul">
<li>download and unzip elasticsearch-2.2.0.tar.gz
</li>
<li>edit ./config/elasticsearch.yml
</li>
</ul>
<pre class="example">
cluster.name: qzt360-es
node.name: node-01
network.host: 192.168.36.28
discovery.zen.ping.unicast.hosts: ["192.168.36.28", "192.168.36.31"]
node.master: true
node.data: false/true
</pre>
<ul class="org-ul">
<li>同一主机部署多个服务，将node.name改成全局不重复，其它参数不变，脑裂参数需要适当调整
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 集群状态查看</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
#检查集群健康
curl '192.168.36.28:9200/_cat/health?v'
#集群状态
curl '192.168.36.28:9200/_cluster/stats?pretty'
#集群索引健康度
curl '192.168.36.28:9200/_cluster/health/logstash-2016.02.26/?pretty'
#索引统计
curl '192.168.36.28:9200/position/_stats?pretty'
#集群的节点列表
curl '192.168.36.28:9200/_cat/nodes?v'
#列出所有的索引
curl '192.168.36.28:9200/_cat/indices?v'
#搜索
curl '192.168.36.28:9200/logstash-2016.02.26/_search?q=*&amp;pretty'
curl -XPOST '192.168.36.28:9200/logstash-2016.02.26/_search' -d '
{
  "query": { "match_all":{}},
  "from": 10,
  "size": 3,
  "_source": ["message"]
}'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Kibana安装</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>download kibana-4.4.1-linux-x64.tar.gz 
</li>
<li>config
</li>
</ul>
<pre class="example">
elasticsearch.url: "http://192.168.36.28:9200"
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 简写规定</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
curl -XGET 'localhost:9200/_count?pretty' -d '
{
    "query": {
        "match_all": {}
    }
}'
简写为：

GET /_count
{
    "query": {
        "match_all": {}
    }
}
</pre>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 索引</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 存储数据</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
curl -XPUT 'localhost:9200/megacorp/employee/1' -d '
{
    "first_name" : "John",
    "last_name" :  "Smith",
    "age" :        25,
    "about" :      "I love to go rock climbing",
    "interests": [ "sports", "music" ]
}'

curl -XPUT 'localhost:9200/megacorp/employee/2' -d '
{
    "first_name" :  "Jane",
    "last_name" :   "Smith",
    "age" :         32,
    "about" :       "I like to collect rock albums",
    "interests":  [ "music" ]
}'

curl -XPUT 'localhost:9200/megacorp/employee/3' -d '
{
    "first_name" :  "Douglas",
    "last_name" :   "Fir",
    "age" :         35,
    "about":        "I like to build cabinets",
    "interests":  [ "forestry" ]
}'
</pre>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 搜索</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> 简单搜索</h4>
<div class="outline-text-4" id="text-4-2-1">
<pre class="example">
curl -XGET 'localhost:9200/megacorp/employee/_search'
curl -XGET 'localhost:9200/megacorp/employee/_search?q=last_name:Smith'
</pre>
</div>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> 使用DSL语句查询</h4>
<div class="outline-text-4" id="text-4-2-2">
<pre class="example">
curl -XGET 'localhost:9200/megacorp/employee/_search' -d '
{
    "query": {
        "match": {
          "last_name" : "Smith"
        }
    }
}'
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 集群检测插件</h2>
<div class="outline-text-2" id="text-5">
<p>
bigdesk
发现版本不匹配，bigdesk版本很老，有段时间没更新了
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> marvel插件安装</h2>
<div class="outline-text-2" id="text-6">
<p>
没有安装成功，暂且不搞它
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Logstash使用</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>download logstash-2.2.2.tar.gz
</li>
</ul>
</div>
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 测试代码</h3>
<div class="outline-text-3" id="text-7-1">
<pre class="example">
bin/logstash -e 'input { stdin { } } output { stdout {} }'
# The # character at the beginning of a line indicates a comment. Use
# comments to describe your configuration.
input {
#  stdin{
#  }
  file{
    path =&gt; "/home/qzt_es/input/log.txt"
    start_position =&gt; beginning
  }
}
# The filter part of this file is commented out to indicate that it is
# optional.
# filter {
#
# }
output {
#  stdout{
#    codec =&gt; rubydebug
#  }
  elasticsearch{
    hosts =&gt; "http://192.168.36.28:9200"
  }
}
</pre>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 配置文件示例</h3>
<div class="outline-text-3" id="text-7-2">
<pre class="example">
# The # character at the beginning of a line indicates a comment. Use
# comments to describe your configuration.
input {
#  stdin{
#  }
  file{
    path =&gt; "/home/qzt_es/input/mac_tel.txt"
    type =&gt; "mac_tel"
    start_position =&gt; beginning
  }
  file{
    path =&gt; "/home/qzt_es/input/mac_idcard.txt"
    type =&gt; "mac_idcard"
    start_position =&gt; beginning
  }
}
# The filter part of this file is commented out to indicate that it is
# optional.
filter {
  if [type] == "mac_tel" {
    grok {
      match =&gt; { "message" =&gt; "%{MAC:mac}\t%{WORD:tel}" }
      #overwrite =&gt; ["message"]
    #  remove_field =&gt; ["message"]
    }
  } else if [type] == "mac_idcard" {
    grok {
      match =&gt; { "message" =&gt; "%{MAC:mac}\t%{WORD:idcard}" }
      #overwrite =&gt; ["message"]
    #  remove_field =&gt; ["message"]
    }
  }
}
output {
#  stdout{
#    codec =&gt; rubydebug
#  }
  elasticsearch{
    hosts =&gt; "http://192.168.36.28:9200"
    index =&gt; "maclog"
    document_id =&gt; "%{message}" 
#    hosts =&gt; ["http://192.168.36.28:9200", "http://192.168.36.31:9200", "http://192.168.
36.32:9200", "http://192.168.36.33:9200", "http://192.168.36.34:9200"]
  }
}
</pre>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> <span class="label label-default DONE">DONE</span> 手工定义数据类型</h3>
<div class="outline-text-3" id="text-7-3">
<pre class="example">
curl -XPUT '192.168.36.28:9200/wlanlog/test/demo' -d '
{
    "put_time" : {
      "index": "analyzed",
      "type": "date"
    }
}'
curl -XDELETE '192.168.36.28:9200/wlanlog'

curl -XPUT '192.168.36.28:9200/wlanlog/_mapping' -d '
{
  "mappings" : {
    "syslog" : {
      "properties" : {
        "file_path" : {
          "type" : "string"
        }
      }
    }
  }
}'
#Delete Index
curl -XDELETE '192.168.36.28:9200/testindex'

#Create Index
curl -XPUT '192.168.36.28:9200/testindex/'

#Put Mapping
curl -XPUT '192.168.36.28:9200/testindex/_mapping/testtype' -d '
{
  "properties" : {
    "put_time" : {
      "type" : "date"
    },
    "log_level" : {
      "type" : "string"
    },
    "class_path" : {
      "type" : "string"
    },
    "file_path" : {
      "type" : "string",
      "index" : "not_analyzed"
    }
  }
}'

curl -XPUT '192.168.36.28:9200/testindex/_mapping/testtype' -d '
{
        "properties" : {
          "@timestamp" : {
            "type" : "date",
            "format" : "strict_date_optional_time||epoch_millis"
          },
          "@version" : {
            "type" : "string"
          },
          "class_path" : {
            "type" : "string"
          },
          "file_path" : {
            "type" : "string",
            "index" : "not_analyzed"
          },
          "host" : {
            "type" : "string"
          },
          "log_level" : {
            "type" : "string"
          },
          "message" : {
            "type" : "string"
          },
          "path" : {
            "type" : "string"
          },
          "put_time" : {
            "type" : "string"
          },
          "type" : {
            "type" : "string"
          }
        }
}'
#View
curl -XGET '192.168.36.28:9200/testindex/_mapping?pretty'
curl -XGET '192.168.36.28:9200/testindex/_search?pretty'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> ES公司内部培训</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> ElasticSearch简介</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Elasticsearch是一个实时分布式搜索和分析引擎。它基于Lucene的开源搜索引擎。
可用于全文搜索、结构化搜索、分析以及将这三者混合使用
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 和关系数据库的对应关系</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Relational DB -&gt; Databases -&gt; Tables -&gt; Rows -&gt; Columns
</p>

<p>
Elasticsearch -&gt; Indices   -&gt; Types  -&gt; Documents -&gt; Fields
</p>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> ES安装部署</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>add user
</li>
</ul>
<pre class="example">
useradd -m -s /bin/bash qzt_es
</pre>
<ul class="org-ul">
<li>jdk
</li>
</ul>
<pre class="example">
jdk-8u73-linux-x64.tar.gz
export JAVA_HOME=/home/qzt_es/jdk1.8.0_73
export CLASSPATH=$JAVA_HOME/lib:$JAVA_HOME/jre/lib:.
export PATH=$JAVA_HOME/bin:$JAVA_HOME/jre/bin:$PATH
</pre>
<ul class="org-ul">
<li>download and unzip elasticsearch-2.2.0.tar.gz
</li>
<li>edit ./config/elasticsearch.yml
</li>
</ul>
<pre class="example">
cluster.name: qzt360-es
node.name: node-01
network.host: 192.168.36.28
discovery.zen.ping.unicast.hosts: ["192.168.36.28", "192.168.36.31"]
discovery.zen.minimum_master_nodes: 3
node.master: true
node.data: false/true
</pre>
<ul class="org-ul">
<li>同一主机部署多个服务，将node.name改成全局不重复，其它参数不变，脑裂参数需要适当调整
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 简单数据操作</h3>
<div class="outline-text-3" id="text-8-4">
</div><div id="outline-container-sec-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> 存储数据</h4>
<div class="outline-text-4" id="text-8-4-1">
<pre class="example">
curl -XPUT '192.168.36.28:9200/megacorp/employee/1' -d '
{
    "first_name" : "John",
    "last_name" :  "Smith",
    "age" :        25,
    "about" :      "I love to go rock climbing",
    "interests": [ "sports", "music" ]
}'

curl -XPUT '192.168.36.31:9200/megacorp/employee/2' -d '
{
    "first_name" :  "Jane",
    "last_name" :   "Smith",
    "age" :         32,
    "about" :       "I like to collect rock albums",
    "interests":  [ "music" ]
}'

curl -XPUT '192.168.36.32:9200/megacorp/employee/3' -d '
{
    "first_name" :  "Douglas",
    "last_name" :   "Fir",
    "age" :         35,
    "about":        "I like to build cabinets",
    "interests":  [ "forestry" ]
}'
</pre>
</div>
</div>

<div id="outline-container-sec-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> 简单搜索</h4>
<div class="outline-text-4" id="text-8-4-2">
<pre class="example">
curl -XGET '192.168.36.28:9200/megacorp/employee/_search'
curl -XGET '192.168.36.28:9200/megacorp/employee/_search?q=last_name:Smith'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 集群状态查看</h3>
<div class="outline-text-3" id="text-8-5">
<pre class="example">
#检查集群健康
curl '192.168.36.28:9200/_cat/health?v'
#集群状态
curl '192.168.36.28:9200/_cluster/stats?pretty'
#集群索引健康度
curl '192.168.36.28:9200/_cluster/health/megacorp/?pretty'
#索引统计
curl '192.168.36.28:9200/megacorp/_stats?pretty'
#集群的节点列表
curl '192.168.36.28:9200/_cat/nodes?v'
#列出所有的索引
curl '192.168.36.28:9200/_cat/indices?v'
#搜索
curl '192.168.36.28:9200/megacorp/_search?q=*&amp;pretty'
curl -XPOST '192.168.36.28:9200/megacorp/_search' -d '
{
  "query": { "match_all":{}},
  "from": 10,
  "size": 3,
  "_source": ["message"]
}'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 启动es的脚本</h2>
<div class="outline-text-2" id="text-9">
<pre class="example">
#!/bin/bash
for i in `jps | grep Elasticsearch | awk '{print$1}'`
do
  echo "kill "$i
  kill $i
done
sleep 7
export ES_HEAP_SIZE=2g
/home/qzt_es/elasticsearch-2.3.3/bin/elasticsearch -d
echo "ES restart done!"
</pre>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. ElasticSearch安装</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. 集群状态查看</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Kibana安装</a></li>
<li><a href="#sec-3">3. 简写规定</a></li>
<li><a href="#sec-4">4. 索引</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. 存储数据</a></li>
<li><a href="#sec-4-2">4.2. 搜索</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 集群检测插件</a></li>
<li><a href="#sec-6">6. marvel插件安装</a></li>
<li><a href="#sec-7">7. Logstash使用</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. 测试代码</a></li>
<li><a href="#sec-7-2">7.2. 配置文件示例</a></li>
<li><a href="#sec-7-3">7.3. 手工定义数据类型</a></li>
</ul>
</li>
<li><a href="#sec-8">8. ES公司内部培训</a>
<ul class="nav">
<li><a href="#sec-8-1">8.1. ElasticSearch简介</a></li>
<li><a href="#sec-8-2">8.2. 和关系数据库的对应关系</a></li>
<li><a href="#sec-8-3">8.3. ES安装部署</a></li>
<li><a href="#sec-8-4">8.4. 简单数据操作</a></li>
<li><a href="#sec-8-5">8.5. 集群状态查看</a></li>
</ul>
</li>
<li><a href="#sec-9">9. 启动es的脚本</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-07 Sat 23:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
